[
  {
    "title": "Government shutdown leaves federal workers ‘on edge’ as Trump eyes more job cuts",
    "description": "Government shutdown leaves federal workers ‘on edge’ as Trump eyes more job cuts  The GuardianThe government shutdown is a slow-boil political crisis  CNNMore Americans blame Trump, Republicans for shutdown than Democrats: Survey  The HillHere's what Trump wants to do to reshape the federal government during the shutdown  Fox NewsWe asked 1,000 Americans who is to blame for the shutdown. Here’s what they said.  The Washington Post",
    "published date": "Thu, 02 Oct 2025 01:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNSXJ2OVZRX1B6MldsVWYxMnFTNVRkeVpWbGM1MlF1YldfTTZXLTJ1RmI0Z3VUS0VaM2FQUUJWdXVDX0hFNVdDV3hHRkJwLUJ3UGFza0IxMkVJTXN0cEpRYnhzN1FKNGljUXRvSUZ5LTVmNUFZeFB3LVdRc2VFY1dqclE3TmFzZDlXU1NkSFBycFhBQ00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.theguardian.com/us-news/2025/oct/01/federal-workers-government-shutdown-trump",
    "decoded_successfully": true,
    "full_text": "An estimated 750,000 federal employees are furloughed as a result of the first federal government shutdown since 2018.\n\nMany have been “on edge for months”, according to James Kirwan, who works as a labor attorney inside a government agency. Now the Trump administration is threatening to implement another sweeping wave of cuts to their ranks.\n\nShutdowns cause widespread disruption – both to government services and the lives and livelihoods of the staff that typically work to deliver them.\n\nClaire Babineaux-Fontenot, CEO of the Feeding America network of food banks, warned “many people” in the US are “a single missed paycheck” away from needing to turn to a food bank for support. “A prolonged shutdown will deepen the strain, and more families will seek help at a time when food banks are already stretched due to sustained high need,” she said in a statement.\n\nThe shutdown “hurts federal workers in many ways”, Kirwan, who organizes with the Federal Unionists Network, said. “We want to be working. We want to be serving the public.”\n\nDuring a shutdown, many federal workers, especially those earning less than $100,000 annually, are forced to dip into savings, rack up credit-card debt, or take out loans to survive until they receive back pay when the government reopens, Kirwan said.\n\n“And that doesn’t even go into all the emotional and psychological harm too. We are federal workers because we care deeply about the federal government, and we care deeply about serving our constituents and the public,” he added. “To be kept from our ability to serve the American public, it hurts.”\n\n“And then”, Kirwan continued, “you add in the fear that we might be fired”.\n\nThe Trump administration has faced criticism for ordering federal agencies to draw up plans for mass-scale firings in the event of a government shutdown. The US president suggested he would use the pause to “get rid of a lot of things we didn’t want” earlier this week.\n\nTrump has already overseen the largest mass resignation in US history this week, with more than 100,000 federal workers set to formally quit as part of the latest wave of his administration’s deferred resignation program.\n\nNow workers are left wondering if this shutdown will leave them out of work temporarily, or set the stage for their permanent termination.\n\nIn a memo seen by the Guardian, the US Patent and Trademark Office (USPTO) announced a “reduction in force” (RIF) program of layoffs at the agency on Wednesday, the first reported agency to do so.\n\n“Approximately one percent of the USPTO workforce will be affected by this RIF,” wrote Valencia Martin Wallace, acting commissioner for the USPTO, wrote to employees at the agency. The USPTO did not respond to a request for comment\n\nAt the Environmental Protection Agency (EPA), only about 1,700 out of 15,000 workers are set to keep working during the shutdown.\n\n“The workers who do the majority of the frontline work will be furloughed and potentially RIF’ed,” said Justin Chen, an environmental engineer and president of the American Federation of Government Employees (AFGE) Council 238, which represents thousands of EPA workers. “We may be recalled for emergencies, but the workers who do the work which prevents those emergencies won’t be done.”\n\nEven workers who are still working, for the time being, are bracing for possible layoffs amid the shutdown.\n\n“We still are yet again finding, as federal employees, a level of concern as our livelihoods being used as a pawn, being used in this showdown between Donald Trump and the oligarchs against the working class,” said Colin Smalley, who works for the US army corps of engineers in Chicago, and represents 300 workers as president of International Federation of Professional and Technical Engineers Local 777. “They are trying to extract these big changes on the backs of the public services federal workers provide and our communities run on.”\n\nThe Trump administration estimates it will cut the federal workforce by about 300,000 workers by the end of the year.\n\nMuch of these cuts have yet to be reflected in monthly jobs report data, which will not be released due to the shutdown. As of August, federal employment is down 97,000 jobs.\n\nThe last shutdown started in December 2018 and lasted 35 days, until January 2019, costing the US economy an estimated $11bn, according to the Congressional Budget Office.\n\nKirwan suggested the federal government, since Trump took office, has already effectively been operating under a partial shutdown, with about one-eighth of the federal workforce removed, several agencies dismantled and programs eliminated.\n\n“We do not want a shutdown, but we know that the most important thing is standing up against further harms through our programs,” he said. “More and more harm has been happening every single month to programs that are critical and that tens of millions of Americans rely upon.\n\n“I hope that the budget that is passed will come with assurances that will protect against further harms to critical programs, because we serve the public. Our government serves the public, and we need to make sure that there are no further harms to those programs.”\n\nLabor unions filed a lawsuit on Tuesday over the firing threats, alleging the move is unlawful and an effort to punish workers and pressure Congress.\n\n“Announcing plans to fire potentially tens of thousands of federal employees simply because Congress and the administration are at odds on funding the government past the end of the fiscal year is not only illegal – it’s immoral and unconscionable,” said Everett Kelley, president of the American Federation of Government Employees, in a statement. “Federal employees dedicate their careers to public service – more than a third are military veterans – and the contempt being shown them by this administration is appalling.”",
    "authors": [
      "Michael Sainato"
    ],
    "images": [
      "https://i.guim.co.uk/img/media/18e18e5627af31788779cdc23722fc000d708980/0_0_7538_5025/master/7538.jpg?width=465&dpr=1&s=none&crop=none",
      "https://i.guim.co.uk/img/media/18e18e5627af31788779cdc23722fc000d708980/630_0_6277_5025/master/6277.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eea1df5e0ee6646a8cb534a9800162e6",
      "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=us-news"
    ],
    "top_image": "https://i.guim.co.uk/img/media/18e18e5627af31788779cdc23722fc000d708980/630_0_6277_5025/master/6277.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eea1df5e0ee6646a8cb534a9800162e6",
    "publish_date": "2025-10-01 00:00:00"
  },
  {
    "title": "Two dead in UK synagogue attack on Yom Kippur, suspect 'with bomb' shot by police",
    "description": "Two dead in UK synagogue attack on Yom Kippur, suspect 'with bomb' shot by police  ReutersPolice treating Manchester synagogue attack in which two died as terrorist incident  BBC2 Killed in Stabbing Outside Synagogue on Yom Kippur in Manchester, UK Police Say: Live Updates  The New York TimesEverything we know about the Manchester synagogue ‘terror’ attack  The TelegraphManchester synagogue attack, car ramming: 2 dead, suspect shot, police say  NBC News",
    "published date": "Thu, 02 Oct 2025 12:47:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNZjZ1XzZnS3JBUHNsOFZfdVV3MHYyRlpNWjRBMlFOWXVFRk1vOFZnNEM1N2tyYmpselhYcDNieXU1Z1EtRHlPSkNMSGFWbFUxdzdBY2tMWkVDZUw4b1liQWJ4endsUjViOHlqZmVMLXRGclZnT2ZaUVpXaExzVXFpeHBfXzg2Q3VFSWQ5TW1OUzNwNVE3Q1dmNU12b2c2QnVkdnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    },
    "category": "WORLD",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.reuters.com/world/uk/uk-police-respond-incident-outside-synagogue-manchester-2025-10-02/",
    "decoded_successfully": true,
    "full_text": null,
    "error": "Article `download()` failed with 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/world/uk/uk-police-respond-incident-outside-synagogue-manchester-2025-10-02/ on URL https://www.reuters.com/world/uk/uk-police-respond-incident-outside-synagogue-manchester-2025-10-02/",
    "authors": [],
    "images": [],
    "top_image": null,
    "publish_date": null
  },
  {
    "title": "Trump to talk with Vought about which ‘Democrat Agencies’ should be cut",
    "description": "Trump to talk with Vought about which ‘Democrat Agencies’ should be cut  PoliticoGovernment Shutdown Live Updates: Trump and Republicans' Deadlock With Democrats Drags On  The New York TimesIs the federal government still shut down? Here’s the latest.  USA TodayTrump sees 'unprecedented opportunity' to cut government during shutdown  Fox NewsNo clear path out of the shutdown as Trump administration warns of ‘imminent’ layoffs  CNN",
    "published date": "Thu, 02 Oct 2025 12:59:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOLW5FdHJNbWktYWFHMmFkS09hdk5EaHdhU1FCVERGOTF3ODA0amp2VlRGOHd4TmN0blZYZ0F4Ry01WWItbFRZRjA1VVp2bFNXeXpXWWRmaEo4VmUxZVdmSWREQTdZT3ZwTjN3dUE3OW1NSDNJLTNrcUxQWGVPeEw0YmU0aXlGSXlBcnlpOXcyVUg2dzdNOGNJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.politico.com/live-updates/2025/10/02/congress/trump-to-talk-with-vought-00591585",
    "decoded_successfully": true,
    "full_text": null,
    "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.politico.com/live-updates/2025/10/02/congress/trump-to-talk-with-vought-00591585 on URL https://www.politico.com/live-updates/2025/10/02/congress/trump-to-talk-with-vought-00591585",
    "authors": [],
    "images": [],
    "top_image": null,
    "publish_date": null
  },
  {
    "title": "Air traffic controllers helped end the last government shutdown, and may again",
    "description": "Air traffic controllers helped end the last government shutdown, and may again  NPRWhat the federal government shutdown might mean for flights and other travel in the US  CNNCongress just created a new reason to worry about air travel  PoliticoIs TSA still operating during the shutdown? What air travelers need to know.  USA TodayWill the Government Shutdown Affect Flights? What to Know.  The New York Times",
    "published date": "Thu, 02 Oct 2025 09:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNRmkzeTRpRmctUVNraER4R0dMeHFIQmdMc2VhYUhPU2FSSk9NMnVSTWNIbWRSUEVmcFRwQ2pxOVlOTy1EU2l2d1VSMEdGaEhvN3ZzbHdfVW9rMTNUYjY4VlY0RUo4NlBWWXlsaFI5V2tGU2NZa0pHUjJUTmp0Y0xSUWxhdzB2Wnd4cDFJZGZVWlFfQ1F2UHNHUFJXRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.npr.org/2025/10/02/nx-s1-5560219/air-traffic-controllers-ending-government-shutdown",
    "decoded_successfully": true,
    "full_text": "Air traffic controllers helped end the last government shutdown, and may again\n\ntoggle caption Brandon Bell/Getty Images\n\nWASHINGTON — More than a month into the last government shutdown in 2019, a few air traffic controllers finally reached their breaking point.\n\nThere was only a \"slight increase\" in sick leave at two facilities in Virginia and Florida that handle high-altitude traffic, according to the Federal Aviation Administration. But it was enough to throw some major East Coast airports into chaos.\n\nWith another shutdown underway, U.S. airlines are once again bracing for the possibility of delays and disruptions to commercial aviation.\n\n\"You have the reality of human beings, many of [whom] are living paycheck to paycheck,\" said Dennis Tajer, a longtime pilot for American Airlines, and a spokesman for the union that represents its 16,000 pilots. \"It doesn't take long before the system slows down. The safety margin is always protected. But what happens is we meter the amount of aircraft that the system can hold.\"\n\nSponsor Message\n\nThat's what happened on January 25th, 2019, when a shortage of air traffic controllers forced the FAA to limit traffic at LaGuardia Airport in New York, along with other major airports from Newark, N.J. to Orlando, Fla.\n\nThat same day, President Trump agreed to a temporary government funding measure, effectively ending the longest shutdown in U.S. history after 35 days. Exactly how much those disruptions to commercial aviation had to do with the funding deal remains open to interpretation, though some observers think it was an important factor.\n\nLawmakers in Washington appear far from an agreement to end the current government shutdown that began early Wednesday morning.\n\nUnlike the prior shutdown, the Department of Transportation says it will keep the FAA's air traffic controller training academy open, part of a push to meet its ambitious hiring goals.\n\nStill, the shutdown will hurt the nearly 14,000 current controllers who have to work through it, even though they won't get paid until it ends.\n\n\"It's an unnecessary distraction\" on top of what is already \"one of the most stressful jobs in the entire world,\" Nick Daniels, the president of National Air Traffic Controllers Association, said in a video message to members posted on Sunday.\n\nSponsor Message\n\n\"We have people that will have to decide, do I take a second job? Do I have to do Uber? Do I have to find some source of income during this time?,\" he said.\n\nBut Daniels urged controllers to be professional — and pleaded with them not to engage in any kind of coordinated job action, because that could prompt the Trump administration to try to decertify the union.\n\ntoggle caption Andrew Caballero-Reynolds/AFP via Getty Images\n\n\"Our professionalism and our credibility will be being looked at. And not only is your career at stake, but the right to have a union will be at stake during that time,\" Daniels said in a recent town hall meeting with members.\n\nThe union denies having any role in the slowdown of the nation's airspace in 2019. But as that incident demonstrated, even a small number of controllers calling in sick can have a big impact.\n\n\"It's a disaster for me,\" said one current air traffic controller who handles approaching and departing flights at a major U.S. airport. He asked NPR not to use his name because he's afraid of retaliation from the FAA.\n\n\"I work at the very top level of air traffic control as a profession, and I struggle financially,\" the controller said. \"And missing a paycheck — I can probably miss one. But it will hurt badly.\"\n\nThe controller said morale in the workforce is lower than it was six years ago, as the staffing shortage has gotten worse, and pay has stagnated. And he thinks air traffic controllers will once again call in sick.\n\n\"It doesn't even have to be organized,\" the controller said. \"I think that enough people will individually make the decision that they don't feel like going to work that this will not last a tremendous amount of time.\"",
    "authors": [
      "Joel Rose"
    ],
    "images": [
      "https://media.npr.org/assets/img/2024/11/20/trumps-terms_tile-art_sq-a562bd2ad2a39113dc7da18658fc1e25d0664257-s100-c100.jpg",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2528x2528+867+0/resize/100/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3b%2Fc9%2Ffee2f83b462193dc282bfef3dbc3%2Fgettyimages-2238130013.jpg",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8223x5482+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F82%2Fe402ecf04f33a9764a79efb61cae%2Fgettyimages-2238589311.jpg",
      "https://media.npr.org/chrome/programs/logos/fresh-air.png",
      "https://media.npr.org/assets/img/2024/01/11/podcast-politics_2023_update1_sq-eaabdbd6adb312e163cb96909efd902cc2e9e004-s100-c100.jpg",
      "https://prod-eks-static-assets.npr.org/chrome_svg/music-logo-light.svg",
      "https://media.npr.org/chrome/programs/logos/all-things-considered.png",
      "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x4000+1000+0/resize/100/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7d%2F97%2F944ee6b741348e61dd922f0eb86f%2Fgettyimages-2233901120.jpg",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5327x3549+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F44%2F65fcdf8348bf8f41b76e4f056d5a%2Fgettyimages-2238160970.jpg",
      "https://media.npr.org/chrome/programs/logos/morning-edition.jpg",
      "https://prod-eks-static-assets.npr.org/chrome_svg/npr-logo-2025.svg",
      "https://media.npr.org/assets/img/2024/08/01/embedded_podcast-tile_sq-21d8f227c811e4f3a0e28b4aa774dd17e39287db-s100-c100.jpeg",
      "https://media.npr.org/assets/img/2024/05/15/throughline_tile-art_sq-a59d7da2ea2bf97562aeec6440ddf837e8f7de65-s100-c100.jpg",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/895x895+0+129/resize/100/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fcb%2F78%2F32f6f8ba419296f51624b33a63e7%2Fjoel-rose.PNG",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8223x4625+0+294/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F82%2Fe402ecf04f33a9764a79efb61cae%2Fgettyimages-2238589311.jpg",
      "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2",
      "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2735x2735+758+0/resize/100/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2F8a%2Fb6fc1bf84127bfa745f16d110c24%2Fgettyimages-2237944430.jpg",
      "https://prod-eks-static-assets.npr.org/chrome_svg/music-logo-dark.svg",
      "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png"
    ],
    "top_image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8223x4625+0+294/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F82%2Fe402ecf04f33a9764a79efb61cae%2Fgettyimages-2238589311.jpg",
    "publish_date": "2025-10-02 00:00:00"
  },
  {
    "title": "‘Dangerous Cities,’ the Military, Trump and the Founding Fathers",
    "description": "‘Dangerous Cities,’ the Military, Trump and the Founding Fathers  The New York TimesPete Hegseth's speech to generals crossed an ominous line  MSNBC NewsThe Commander in Chief Is Not Okay  The AtlanticFemale vets fire back at Hegseth over claims of lowered military standards  AxiosFor Trump and Hegseth, the ‘warrior ethos’ comes with ultimatums for hundreds of generals and admirals  CNN",
    "published date": "Thu, 02 Oct 2025 00:14:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPQWRUOWVaRjB5U0lqTUJyVE15QXNlNmFXRHJsOWZTZnJuSjVZajdZU1JUelNxUlp5ZXdSdXhLZDJFSTFtS0xxQjJEQnFwTnJPcndqb0huRk1GLUdMT2NiaExHVUgwTDZqNnFWVzhGMFRCUW9OTVQwWXBwWHpQMjdPcjZudHNBbDBJZDhz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    },
    "category": "WORLD",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.nytimes.com/2025/10/01/us/politics/trump-military-founding-fathers.html",
    "decoded_successfully": true,
    "full_text": "In the middle of Tuesday’s rambling speech at Marine Corps Base Quantico in Virginia, President Trump told hundreds of the country’s military commanders his latest thinking on where they should next set their sights.\n\nNot Poland, or Romania, or Estonia or Denmark, all NATO allies where Russian drones have in the past month violated airspace in a challenge to the alliance’s borders.\n\nThe president chose San Francisco. Chicago. New York. Los Angeles.\n\n“We’re going to straighten that out one by one, and this is going to be a major part for some of the people in this room,” Mr. Trump told the generals, admirals and enlisted leaders, referring to what he has described as crime-filled urban hellscapes.\n\n“It’s a war from within,” he said.\n\nIn that moment, the president again pitted himself against the wishes of the country’s founding fathers, historians and former military leaders say.",
    "authors": [
      "Helene Cooper"
    ],
    "images": [
      "https://static01.nyt.com/images/2025/10/01/multimedia/01dc-trump-military-02-wczg/01dc-trump-military-02-wczg-facebookJumbo.jpg",
      "https://static01.nyt.com/images/2025/10/01/multimedia/01dc-trump-military-03-wczg/01dc-trump-military-03-wczg-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2018/08/24/multimedia/author-helene-cooper/author-helene-cooper-thumbLarge.png",
      "https://static01.nyt.com/images/2025/10/01/multimedia/01dc-trump-military-02-wczg/01dc-trump-military-02-wczg-articleLarge.jpg?quality=75&auto=webp&disable=upscale"
    ],
    "top_image": "https://static01.nyt.com/images/2025/10/01/multimedia/01dc-trump-military-02-wczg/01dc-trump-military-02-wczg-facebookJumbo.jpg",
    "publish_date": "2025-10-01 00:00:00"
  },
  {
    "title": "Frozen federal funds for Hudson Tunnel project hit New Jersey's race for governor",
    "description": "Frozen federal funds for Hudson Tunnel project hit New Jersey's race for governor  NBC NewsView Full Coverage on Google News",
    "published date": "Wed, 01 Oct 2025 21:16:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNd01abkoxQVZNX05Rak5WMUlYTm85WTlVc2NXb0pIQmZvQTFLZkV6bGR2YlJzcEk1cERtWEJwcnlRQW5UaU5CeldTWm84ZVk4bWFXOU1qa3VxcE1UaGNKODNrTG84b2R1Rm9tb0V6UFlQWi1CV0RUb2F2ODYzeDJjOF9tUDJ6WWp2MEctNXNEX0xtV3FTdElBa3d5aWxncDRGdXRfUTh6VEZUZU1pNjlaZtIBVkFVX3lxTE1VZFlkUUNjVU9OcEM5OUw1dTFqbWxGZHBCYlJzeXVqZHZvdlBDSHAtSGd2eXQ5Y0F2blJFRzdmaWxmLU1KbmVJdEVPTmVFazk1aTZwdnBn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.nbcnews.com/politics/elections/frozen-federal-tunnel-funds-hit-new-jerseys-race-governor-rcna235020",
    "decoded_successfully": true,
    "full_text": "The candidates vying to be New Jersey’s next governor are pointing fingers after the Trump administration announced it is freezing billions of dollars in federal funding for two infrastructure projects, including the Hudson Tunnel project to connect New Jersey and New York City.\n\nDemocratic Rep. Mikie Sherrill slammed the move Wednesday and called the pause in funding further evidence that her opponent, Republican Jack Ciattarelli, would not stand up to President Donald Trump. Ciattarelli’s campaign placed the blame on Sherrill for opposing the GOP-led government funding measure, which passed the House last month but stalled in the Senate amid Democratic opposition.\n\nThe funding freeze for the tunnel project comes with just a few weeks until the November election to succeed Democratic Gov. Phil Murphy, who cannot run for re-election because of term limits.\n\nAfter the federal government shut down Wednesday, with Congress failing to reach a funding agreement, White House budget director Russell Vought announced the administration would pause the funding for the Hudson Tunnel Project and the Second Avenue Subway, “to ensure funding is not flowing based on unconstitutional DEI principles.” The Transportation Department said on X that the delay was “another casualty of radical Democrats’ reckless decision to hold the federal government hostage to give illegal immigrants benefits.” (U.S. law prohibits federal health care benefits for undocumented immigrants.)\n\nSherrill often speaks about her work to secure funding for the project, also known as the Gateway Hudson Tunnel Project, saying in a recent gubernatorial debate that she was once dubbed the “tunnel-obsessed congresswoman.”\n\n“I first ran on a promise to build the Gateway Tunnel, and I delivered,” she said in a statement.\n\nSherrill pledged to “fight tooth and nail to complete this essential infrastructure project for New Jersey. Jack Ciattarelli will not. He’s refused to name a single area where he disagrees with Trump and has already said he would never sue the Trump administration. He will choose Trump over New Jersey every time.”\n\n“Make no mistake: When I’m governor, I will see them in court and deliver Gateway for New Jersey,” she said.\n\nCiattarelli has said that, if he is elected, his administration would not sue the White House, calling such lawsuits “a waste of taxpayer dollars.” Ciattarelli did break with Trump in opposing the administration’s plan to house immigrant detainees at a New Jersey military base.\n\nCiattarelli campaign strategist Chris Russell responded to the freeze in funding by blaming Sherrill.\n\n“If Mikie Sherrill did her job as a congresswoman we wouldn’t be in this mess,” Russell said in a statement to NBC News. “Sherrill hasn’t bothered to show up for work in the House more than 90% of the time this year — and now she’s opposing a bipartisan plan to continue funding the government to play politics instead. Make no mistake, Mikie Sherrill owns this shutdown and is responsible for any negative impacts on Gateway tunnel project and other NJ priorities.”\n\nSherrill joined all but one House Democrat in opposing a GOP plan to temporarily extend government funding, as Democrats have demanded that Republicans act to extend Obamacare subsidies to obtain their party’s votes.\n\nSen. Andy Kim of New Jersey, who joined all but three Democrats in the Senate in voting down the GOP funding plan, called the administration’s announcement “illegal.” Kim said he believes the proposal will “backfire when the American people see how partisan this is and how much it’s about retribution.”\n\nAsked which candidate in the key governor’s race the move would hurt the most, Kim replied: “It’s going to hurt New Jersey. And if Jack says there’s nothing he disagrees with Trump on, he owns the delays to Gateway.”\n\n“I think [Trump] really locked in that loss for Republicans in the governor’s race,” Kim told reporters Wednesday.",
    "authors": [
      "Https",
      "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms Head_Shot.Jpeg",
      "Bridget Bowman",
      "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms",
      "Julie Tsirkin",
      "Bridget Bowman Is A National Political Reporter For Nbc News.",
      "Julie Tsirkin Is A Correspondent Covering Capitol Hill."
    ],
    "images": [
      "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-09/250926-Mikie-Sherrill-se-1017a-6f0892.jpg",
      "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/rockcms/2025-09/250926-Mikie-Sherrill-se-1017a-6f0892.jpg",
      "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2024_46/3669091/241113-julie-tsirkin.jpg",
      "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2024_04/3636386/head_shot.jpeg"
    ],
    "top_image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-09/250926-Mikie-Sherrill-se-1017a-6f0892.jpg",
    "publish_date": "2025-10-01 21:16:12.537000+00:00"
  },
  {
    "title": "‘A lot of fight’: Hakeem Jeffries is determined to make a mark on the shutdown standoff",
    "description": "‘A lot of fight’: Hakeem Jeffries is determined to make a mark on the shutdown standoff  PoliticoJeffries says GOP uninterested in negotiating because ‘they apparently wanted’ a shutdown  PBSDemocrats plan unusual House floor tactic ahead of shutdown  AxiosTop Democrats knock ‘erratic and unhinged’ Trump behavior as government shuts down  The HillHouse Democratic Leaders Hold Briefing on Government Shutdown  C-SPAN",
    "published date": "Thu, 02 Oct 2025 08:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQYl9naklHS2ItRFZvRkdTcm9HclFWemowRkFaX29hM0V0c3VZTDhaUmQwYTNTTDFfaGpvQmluazBQVURldEtZVTQ3QUI1MUdxOWM1QW9zUmJIbGFaQmIxWkIyM1JMZDhvU0NVR2M5UVJiUkV5U2lDT3J4LVZyY1VNdHZveWlEaVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.politico.com/news/2025/10/02/hakeem-jeffries-shutdown-fight-00591139",
    "decoded_successfully": true,
    "full_text": null,
    "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.politico.com/news/2025/10/02/hakeem-jeffries-shutdown-fight-00591139 on URL https://www.politico.com/news/2025/10/02/hakeem-jeffries-shutdown-fight-00591139",
    "authors": [],
    "images": [],
    "top_image": null,
    "publish_date": null
  },
  {
    "title": "The facts behind the government shutdown debate over health care and immigrants in the U.S. illegally",
    "description": "The facts behind the government shutdown debate over health care and immigrants in the U.S. illegally  CBS NewsFACT FOCUS: Democrats did not shut down the government to give health care to 'illegal immigrants'  AP NewsFact-checking the GOP's big shutdown claim and FCC chair to testify over Kimmel saga: Morning Rundown  NBC NewsFACT: Democrats Shut Down Government Over Free Healthcare for Illegals  The White House (.gov)GOP on shaky ground with claim about Democrats’ shutdown demands  The Hill",
    "published date": "Thu, 02 Oct 2025 01:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPWHgxUk9SVG02aExXTEUzZ0EwU0hJb1E4TU5QX0Zwalp2RGhYM1ZmWlQzQ3ZIOFl0MlFvM1NNVXhlczhpMjVYbzZfaG13akNPUkNTckdSUk55eDVXVWpKZk44MFhMak1GSEU3MU51UTdPMElrQ1pUeExCSE8tcFJuVWVMZUYwNnduQnN3QXhZaTV5bkhTWUhBZ0RpN1ZXY2hHMkVxLWtaUHdRZDNrUE5OR1U0SlRwWHotdU5DeEJJNkRGT1M50gHKAUFVX3lxTE0wMzRrNjhscDFISUlyY3RLdkNmamJERFd0NmNHMHNNXzl4N2lpTG9jbDZzV0dUUkJQNWJuYmt3Y0NBdTJmMzRRd0JBVGZsTlRSSlZ5bFVYZHB5VnI3QW8yUkhnNXdKRnhyaExHZXY5ZFBwczdJNXBSTWFjQ2VEX3N5WDEtam9BVzNaOEdnYmlKUURXNmg2MGZJR04xNWZpNHFkdWlVUUNhU2hHYU9XMDVxcG5QLUpyS29wZlprNFVzX2RLZFFrWGxUN1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.cbsnews.com/news/the-facts-government-shutdown-health-care-immigrants-in-us-illegally-trump-democrats-republicans/",
    "decoded_successfully": true,
    "full_text": "One of the main lines of attack the White House and Republican lawmakers have leveled against Democrats amid the government shutdown is the claim that Democratic lawmakers want to give immigrants in the U.S. illegally free health care — which Democrats deny.\n\n\"Democrats are holding the American government HOSTAGE so they can give FREE health care to ILLEGAL ALIENS,\" House Speaker Mike Johnson, a Republican from Louisiana, said on social media Wednesday.\n\nMeanwhile, Vice President JD Vance accused Democrats of wanting to \"take from the American people in order to give taxpayer-funded healthcare to illegal immigrants.\"\n\nTrump administration officials and Republican lawmakers have pointed to a provision in the Democrats' funding proposal that would reverse the One Big Beautiful Bill Act's measures narrowing Medicaid eligibility for noncitizens. The changes sought by Democrats would only extend Medicaid coverage to immigrants with some kind of legal status or government protection.\n\nBefore the bill passed earlier this year, U.S. law allowed several classes of immigrants living in the U.S. legally or with the government's permission to apply for and get Medicaid, if they met other requirements.\n\nThose groups included lawful permanent residents (also known as green card holders), Cubans and Haitians who entered the U.S. legally, people granted a humanitarian benefit known as \"parole\" to enter the country, refugees, immigrants who won asylum and others, including those who were issued deportation reprieves by a judge.\n\nSome people in those groups may have crossed into the U.S. illegally but were later granted legal status, like asylum, or deportation deferrals by immigration judges.\n\nThe One Big Beautiful Bill Act — passed by lawmakers and signed by President Trump over the summer — significantly restricted noncitizen eligibility for Medicaid coverage, making it only accessible to lawful permanent residents, Cubans and Haitians who entered the U.S. legally and noncitizens from several Pacific islands.\n\nThe bill excluded those granted parole to enter the U.S., refugees, asylees and the other previously eligible immigrants. Roughly 1.4 million immigrants could lose health insurance coverage under the bill's provisions, according to a KFF analysis of Congressional Budget Office data.\n\nThe Democrats' funding proposal would restore noncitizen eligibility for Medicaid to the longstanding pre-2025 rules, reopening access for the classes of immigrants who were carved out earlier this year. All of those immigrants are in the U.S. either legally or with the government's permission.\n\nU.S. law has long rendered people living in the U.S. illegally — without any type of legal status — ineligible for most federal benefits, including Medicaid.\n\nTrump administration officials, however, have argued that some of the lawfully present immigrants previously eligible for Medicaid were illegally let in by the Biden administration. They argue that in the case of those granted parole, the Biden administration waved them in using a \"magic wand,\" in violation of federal immigration law.\n\nThe groups of people granted parole under former President Biden — such as Venezuelans and Ukrainians — entered the country with the government's permission and were authorized to work and live in the U.S. The Trump administration has suspended those Biden-era parole programs, and revoked the legal status of many of those who arrived under them.\n\nThe legal status of many of the other immigrants eligible for Medicaid before the \"One Big Beautiful Bill\" — like the refugees and asylees — is not disputed. Both refugees and asylees are on a path to permanent legal status and eventually, U.S. citizenship.\n\nWhile people who are in the U.S. illegally are not covered by federal Medicaid, the program may reimburse hospitals providing emergency care to immigrants who lack legal status. Emergency funding for noncitizens constitutes less than 1% of total spending for the program, according to an analysis by KFF. The One Big Beautiful Bill Act lowered the amount hospitals can receive for these ER visits, which the Democrats' government funding plan would reverse.\n\nDemocratic leaders have denied that they're seeking to fund health care for immigrants living in the U.S. illegally. Most Democrats' position is that they will not vote for a short-term funding extension that would allow the government to reopen unless Republicans extend Affordable Care Act tax credits that have helped millions of Americans lower their health insurance costs.\n\n\"Federal law prohibits the use of taxpayer dollars to provide medical coverage to undocumented individuals. And there is nothing in anything that we have proposed that is trying to change that law,\" House Democratic Leader Hakeem Jeffries said Tuesday. \"We are fighting for the health care of the American people.\"\n\nSome Republicans have also argued that if Democrats restore the federal Medicaid funding that was cut in the \"One Big Beautiful Bill,\" it would allow Democratic-led states to spend more state funds on health care for immigrants residing in the country unlawfully.\n\nAccording to an analysis by non-partisan health care researchers at KFF, more than a dozen states comprehensively cover care for low-income children who lack a legal immigration status using state funds. Some states, including California, provide some form of coverage to adults living in the country without authorization.\n\nRepublicans previously attempted to penalize these states in Mr. Trump's budget bill, but that provision did not make it into the final legislation.",
    "authors": [
      "Camilo",
      "Immigration Reporter",
      "Camilo Montoya-Galvez Is The Immigration Reporter At Cbs News. Based In Washington",
      "He Covers Immigration Policy",
      "Read Full Bio",
      "Laura",
      "Fact Checker",
      "Cbs News Confirmed",
      "Laura Doan Is A Fact Checker For Cbs News Confirmed. She Covers Misinformation",
      "Ai"
    ],
    "images": [
      "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/02/6fa4d2cb-8435-42ba-880b-f7f793b2831b/thumbnail/1200x630/d3c352c0fb30621c26a43b23e4efc2dc/untitled-design.jpg",
      "https://assets1.cbsnewsstatic.com/hub/i/r/2025/09/30/38a5a5f2-57fb-4710-b40b-32f38f84cab1/thumbnail/96x96/6387d5e1b519c552835f9f934cf10fd5/5p-vo-guns-special-session-wcco8uqr-00-00-0618.jpg",
      "https://assets1.cbsnewsstatic.com/hub/i/2025/10/02/28a27aac-a327-44ac-83ab-0f09f4cf9e2f/cbsn-fusion-government-shutdown-enters-day-2-thumbnail.jpg",
      "https://assets1.cbsnewsstatic.com/hub/i/2024/05/17/f1a49163-df19-4118-a848-129c0ea14af9/camilo-montoya-galvez-bio-2.jpg",
      "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/01/48d3fa13-ecc1-4a9c-a04f-2cd878a24025/thumbnail/96x96/36dcacbe9a67a4b75fe7b9ba4a499cd1/6p-pkg-govt-shutdown-mn-wcco8uzf-1.jpg",
      "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/02/77baa75c-074b-46c9-9c2a-5334522d57b3/thumbnail/96x96/16055df86a88b0fb204deeb4d0f5738f/gettyimages-2238243986.jpg",
      "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/02/dbba7876-2e8c-4bcf-8d19-3bb853f2518b/thumbnail/96x96/09cb8b8f08160bf9da7200740244f008/congress.png",
      "https://assets1.cbsnewsstatic.com/hub/i/2025/01/23/7208852c-0517-4447-b55b-1fe2cd98438c/img-3305.jpg"
    ],
    "top_image": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/02/6fa4d2cb-8435-42ba-880b-f7f793b2831b/thumbnail/1200x630/d3c352c0fb30621c26a43b23e4efc2dc/untitled-design.jpg",
    "publish_date": null
  },
  {
    "title": "Capitol agenda: Thune insists there’s only one way out of the shutdown",
    "description": "Capitol agenda: Thune insists there’s only one way out of the shutdown  PoliticoHow John Thune sees the shutdown ending  PoliticoHouse and Senate Republican Leaders News Conference on Government Shutdown  C-SPANWATCH: Senate Democrats have sacrificed American public with failed funding vote, Thune says  PBSThune says Senate will work over weekend if Democrats don’t reopen government  The Hill",
    "published date": "Thu, 02 Oct 2025 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOeVFSYkVhVnBSV1ZoVlJFcUhXT3A0QTVuQUU1RGdMTy1FakduS3c0em5vZHBQWEJ2Wlk1Z3I1MHNCRVl6QkFzVGl1alUySkNVdDhab243Y2tLLXBwY0VMVEwxTW9hLUtRYWdMLXYxc0JLSDFlUDVNUlJyMDZUNHJlWkFCU282cWV1V0QzelZCQlpCeW15NGpPTzRjQ2x4LXdISkpncjhSNHlJTW83czJoeml5Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.politico.com/live-updates/2025/10/02/congress/thune-shutdown-strategy-negotiations-democrats-00591443",
    "decoded_successfully": true,
    "full_text": null,
    "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.politico.com/live-updates/2025/10/02/congress/thune-shutdown-strategy-negotiations-democrats-00591443 on URL https://www.politico.com/live-updates/2025/10/02/congress/thune-shutdown-strategy-negotiations-democrats-00591443",
    "authors": [],
    "images": [],
    "top_image": null,
    "publish_date": null
  },
  {
    "title": "US Supreme Court expands its 'emergency' docket - and Trump's power too",
    "description": "US Supreme Court expands its 'emergency' docket - and Trump's power too  ReutersJudges Show Strains From Trump’s Emergency Appeals  The Wall Street JournalSupreme Court’s Shadow Docket Scam Collides With Reality  Above the LawSidebar: The shadow docket  Courthouse NewsIt’s Not Just Trump Taking Advantage of Supreme Court’s Emergency Docket  Law.com",
    "published date": "Thu, 02 Oct 2025 10:18:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOWXE2enJybWk1b19nbHRjLVZkcGlMTElkdjl0a0lYQ0lLSUpqenI2VDAyNmo5OEZTc1BJWGdNT2ViVE9keDdGeW52S0ZfOUZNWndtZjRNNUlEbkdnMkdOckFGMng1Z0ttcmdzQUdhMGZUY1QyTXZiYXpQOHJRSTh1VzNnNlJVR1BkVjhPQ1NpM1ZPaWVnWTJfeklnY1dUeTV6bWtsQUY0THdQa3hkNzNDNnp3a2VFQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    },
    "category": "US",
    "category_source": "inferred",
    "search_method": "top_news",
    "actual_url": "https://www.reuters.com/legal/government/us-supreme-court-expands-its-emergency-docket-trumps-power-too-2025-10-02/",
    "decoded_successfully": true,
    "full_text": null,
    "error": "Article `download()` failed with 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/legal/government/us-supreme-court-expands-its-emergency-docket-trumps-power-too-2025-10-02/ on URL https://www.reuters.com/legal/government/us-supreme-court-expands-its-emergency-docket-trumps-power-too-2025-10-02/",
    "authors": [],
    "images": [],
    "top_image": null,
    "publish_date": null
  }
]