[
  {
    "title": "How this startup CTO went on to lead technology and AI for Thomson Reuters",
    "description": "How this startup CTO went on to lead technology and AI for Thomson Reuters  Fortune",
    "published date": "Wed, 01 Oct 2025 14:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxORmNtNlpaWTg4czRtM1ZiV1RuMmljcjlMQWNHbWZybnRoZEFEZ3B1bGc3STNJVVhSWjVFQ2V1YVNpaG5MeFJqR2RHTkZuVHZfa2VoVGswdXo0a3NkcUtmc2pMS2N0c0xaV3pmSl9yRkpPdzJWRTRLSmw0M1IxdUVwVjhvbVM4NjVwMlRyNEM3dThnbEhwd2VQcTBzbTFYU3lScUN2aDRnN1FyUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    },
    "actual_url": "https://fortune.com/2025/10/01/how-this-startup-cto-went-on-to-lead-technology-and-ai-for-thomson-reuters/",
    "decoded_successfully": true,
    "full_text": "When Thomson Reuters acquired ThoughtTrace in 2022, it scooped up a software provider that relied on artificial intelligence and machine learning to analyze documents and contracts for sector-specific use cases in industries like real estate and energy.\n\nThe company also got a future chief technology officer out of the deal.\n\nJoel Hron, who had served as CTO of ThoughtTrace at the time of the acquisition, came into the fold at Thomson Reuters as a VP of technology to spearhead integration into the larger company’s ecosystem that includes the Reuters news agency and various tools sold to legal, tax, and other corporate professionals.\n\nBy 2023, Hron became head of AI and Thomson Reuters Labs, a decades-old research and development group whose work was dramatically changing as the generative AI boom was leading companies to rethink their approach on AI. During Hron’s tenure, TR Labs accelerated hiring and launched seven generative AI products in 18 months, including AI assistants for legal research and contract drafting.\n\nThat group still reports to Hron, who ascended to the CTO role in July 2024. Using the lessons he learned as an outsider who joined Thomson Reuters via an acquired startup, Hron is now helping to steer an aggressive M&A strategy that will continue to see more newly acquired technologies and teams added to the roster.\n\nSince 2019, Thomson Reuters has spent $4.2 billion on acquisitions, adding e-invoicing provider Pagero, and automation software providers SafeSend and SurePrep to the company’s portfolio. Hron says these companies come with unique intellectual property that may take too much time or be too costly for Thomson Reuters to build on its own. There are also times where talent acquisition is a key consideration.\n\n“I think the teams that we’ve acquired have been extremely critical—and I would probably include myself in that—in moving Thomson Reuters forward into being a more entrepreneurial and technology-led company,” says Hron.\n\nIt’s critical that Thomson Reuters and the smaller companies it acquires be aligned on future revenue and user growth targets, says Hron. But there must also be agreement on what technology integration will look like, especially in the first year after the deal closes. He shares the experience of integrating Materia, a startup that specializes in agentic AI tools for tax, audio, and accounting professionals.\n\n“Being a small team, you run this risk of swallowing them and their priorities very early on,” says Hron. It would be easy for Thomson Reuters to get excited about Materia’s more-indie tech solutions and quickly plug it into the dozens of tax products the company offers across its portfolio.\n\nInstead, he advocates that both parties align on as few as three business goals that the Materia team should prioritize. “Everything else that other teams might ask of you are not necessary,” he adds. That allows the smaller startup to remain focused on the specific problems that they were built to solve in the first place.\n\nAfter the one-year mark, integration accelerates, a reflection of technology maturing and the combined companies having a shared roadmap of future product development, as well as Thomson Reuters wanting to get the most out of the hundreds of millions it may spend when buying these startups. By linking acquired technologies in one product suite, Thomson Reuters can make a more compelling pitch to customers.\n\n“A lot of the value proposition of us acquiring companies is really solving the problem for our customers in a more end-to-end way,” says Hron.\n\nWhen it comes to integrating and standardizing back-end systems, Hron describes a more pliable process. Since cybersecurity and compliance standards are uniform across all of Thomson Reuters, acquired startups are immediately standardized. But Hron takes a more hands-off approach when it comes to some administrative tools. If a startup’s team prefers to use Slack, they’re allowed to continue to do so even if Thomson Reuters relies on Microsoft Teams. Over time, as those teams blend together and work more collaboratively, everyone will tend to gravitate to the same systems.\n\nBranding decisions are also taken on a case-by-case basis. Materia’s technology was folded into the company’s CoCounsel offering, while the SafeSend and SurePrep names remained intact because they are still recognizable brands within the market.\n\nThere is also plenty of work that the team has been doing to transform the company’s existing products. In August, Hron says the online research tool Westlaw unveiled Deep Research, an agentic workflow that can plan, review, and strategize legal research in a manner that emulates human work.\n\nWith more than 100 products, each with domain specific-functionality, Hron sees many more opportunities to plug in agentic AI to speed up work for legal and tax professionals.\n\n“That really opens the aperture of what is possible for us with our existing portfolio of applications, if we can really expose them in a way that fits within this agentic context that we’re moving towards,” he said.\n\nJohn Kell\n\nSend thoughts or suggestions to CIO Intelligence here.\n\nNEWS PACKETS\n\nOpenAI, Databricks inks AI agents pact. OpenAI struck a multiyear, $100 million deal to make the AI hyperscaler’s LLMs available for the roughly 20,000 companies that store their data in Databricks’ platform, allowing them to build AI agents with their own enterprise data. The Wall Street Journal reports that Greg Ulrich, chief AI and data officer at Mastercard, said the company is using Databricks to build AI agents in areas such as customer onboarding and support. “The key to getting value out of AI is to be able to link it with your data,” he said. Beyond their new partnership, both OpenAI and Databricks have been ramping up ties to others in the AI ecosystem as annual global spending is projected to ramp to around $1.5 trillion in 2025.\n\nStarbucks CTO resigns. Deb Hall Lefevre, the CTO at Starbucks since 2022, has reportedly resigned according to Reuters, which has seen an internal memo sent to corporate staff on Monday. Lefevre will be succeeded on an interim basis by Ningyu Chen, previously SVP of global experience technology for the coffee giant. The news comes just after Starbucks approved a $1 billion restructuring plan that will include closing underperforming coffeehouses and job cuts as CEO Brian Niccol aims to turn around results, which includes a pivot away from mobile-only “pickup” stores to recreating a more welcoming, inviting environment in the retail shops. Prior to Starbucks, Lefevre spent 16 years at rival McDonald’s.\n\nAnthropic says its new AI model can code for longer than prior versions. A new model, called Claude Sonnet 4.5, can code on its own for up to 30 hours straight, says Anthropic, a big leap from the prior model called Claude Opus 4 which was said to be able to handle coding tasks for up to seven hours by itself. The new model is also reportedly better at following instructions and intended to be more proficient at using an individual’s computer to take actions for them. As Fortune notes, dueling usage studies published earlier this month from Anthropic and OpenAI found that the former’s products are primarily used for work-related tasks like coding and research, while the latter is used mainly for more personal and exploratory purposes.\n\nIntroducing the Fortune AIQ 50 ranking. This week we published the Fortune AIQ 50, a new ranking that evaluates how Fortune 500 companies are actually deploying AI, and how technology leaders value those investments relative to industry peers. The ranking is a record of how 18 sectors across the Fortune 500, including financials, health care, and retailing, are utilizing AI to personalize customer experiences, provide groundbreaking data analysis, optimize supply chains, and more. Explore the list, and catch up on our ongoing Fortune AIQ series.\n\nADOPTION CURVE\n\nMarketers say vast majority of agentic AI projects are stuck in the pilot phase. A survey of 200 marketing leaders found that the industry was fairly optimistic about how much AI would change workflows for their industry, even with little progress to show on actual adoption of the technology thus far. More than eight in ten believe that fully automating content creation would reduce “most to all” of their agency spend, with 60% already reporting that they are spending less on agencies in 2025 due to AI, according to a study conducted by generative AI startup Typeface.\n\nBut most of these leaders (82%) say that their agentic AI projects remain stuck in the pilot phase. The top challenges that are preventing wider deployment were concerns around compliance, legal or privacy issues (56%); lack of technical resources or IT support (53%); and poor data quality, which resulted in the AI agent’s output not being useful (48%).\n\nVishal Sood, chief product officer at Typeface, told Fortune that the company has conversations with CMOs that get super excited about AI’s potential, but that they can be “extremely disconnected from actual day-to-day operators.” He advocates that leaders need to be clearer about their AI strategies and not overwhelm workers with extra work, just because they think AI can handle more asset creation.\n\nCourtesy of Typeface\n\nJOBS RADAR\n\nHiring:\n\n- Illinois Bone & Joint Institute is seeking a CIO, based in the greater Chicago area. Posted salary range: $260K-$320K/year.\n\n- Glencoe Capital is seeking a head of IT, based in the greater Boston area. Posted salary range: $200K-$225K/year.\n\n- TabaPay is seeking a chief information security officer, based in Palo Alto, California. Posted salary: $250K/year.\n\n- Our Blood Institute is seeking a CIO, based in Oklahoma City. Posted salary range: $200K-$250K/year.\n\nHired:\n\n- Kratos Defense & Security Solutions has promoted Brian Shepard to the role of CIO, where he will oversee all IT, including security, information compliance, and data communications for the defense industry manufacturer. Shepard has spent 30 years in the IT field, including the last 20 years working at Kratos, most recently as VP of IT.\n\n- Inogen named Naga Rameswamy as CTO, joining the manufacturer of oxygen concentrators from eye care device maker Alcon, where he served as VP and global head of digital health technology. Prior to Alcon, Rameswamy spent nearly 20 years at GE Healthcare, ending his career there as VP of digital health engineering.\n\n- Stella Automotive AI announced the appointment of Fred Seidelman as CTO, where he will drive the technology strategy and product innovation for the provider of automated services and bookings for car dealerships. Seidelman joins from marketing agency McCann Relationship Marketing, where he served as global CTO and oversaw a team of 450.\n\n- Actabl appointed Joseph Benjamin as CTO, joining the hospitality software provider after most recently serving as CTO at recruiting software maker iCIMS, where he oversaw a 430-person team. He also previously served as chief product and technology officer at software maker Behavox and as CTO of DataLogix, which Oracle later acquired for $1.2 billion.\n\n- Ncontracts appointed Sonja Tsiridis as CTO, joining the governance, risk, and compliance software provider after most recently serving as CTO of cybercrime intelligence data provider Intel 471. Tsiridis was also previously CTO of software developer Zoll Data Systems and spent 12 years at software-as-a-service company GHX, where she served as VP of software engineering.\n\n- CreditRiskMonitor.com announced the appointment of Madhav Kale as CTO, joining the credit reporting firm after most recently serving as EVP and CTO at software provider Carixa. He also previously served as CTO of WellAware and as CEO and founder of Zebra Digital Assets.",
    "authors": [
      "John Kell"
    ],
    "images": [
      "https://fortune.com/img-assets/wp-content/uploads/2025/09/Joel-Hron-CTO-headshot-1.jpg?w=1440&q=90",
      "https://fortune.com/img-assets/wp-content/uploads/2025/09/Joel-Hron-CTO-headshot-1.jpg?resize=1200,600",
      "https://fortune.com/img-assets/wp-content/uploads/2025/09/IMG_4547.jpeg?w=1440&q=85"
    ],
    "top_image": "https://fortune.com/img-assets/wp-content/uploads/2025/09/Joel-Hron-CTO-headshot-1.jpg?resize=1200,600",
    "publish_date": "2025-10-01 00:00:00"
  },
  {
    "title": "How technology is altering citizen protests",
    "description": "How technology is altering citizen protests  Brookings",
    "published date": "Tue, 30 Sep 2025 19:39:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOeEp1Ykdlam5EdG1oVFpVYkpiSkVKME9XYks0NUxJMjFmeEo5aVI1NWl2RzJ3ZmRMSkZIcWlMRDRPUzN4ZmhWNnFCMUQ4T1hjYWs4S1RWSm15aFRVekh3b0VqcWNjd2NZQUUwVVM5N3U3SlJKb3VwTGtjYmJaYUNORUNpSUh5Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.brookings.edu",
      "title": "Brookings"
    },
    "actual_url": "https://www.brookings.edu/articles/how-technology-is-altering-citizen-protests/",
    "decoded_successfully": true,
    "full_text": "During the federal deployment of the military to assist police in Washington, D.C., I saw masked men in unmarked cars detain a person just a few houses down from where I live. It was early morning, and I was returning from the gym when I saw a commotion on my block. A neighbor, upset by the police action, was recording the scene with his cell phone, as many in the nation’s capital do to document possible abuses and share them online for all to see. But in an unexpected move, an agent involved in the detention pulled out his own camera and recorded the citizen filming him. My neighbor then stopped recording and quickly returned to his home, uncertain what the agent’s response might mean for him.\n\nIn this single and graphic moment, I saw two sides of technology’s impact on citizen protests.\n\nOn one hand, ubiquitous smartphones have turned many people into citizen journalists and documentary filmmakers. With instant access to cameras and social media platforms, people can easily record and post videos of arrests by masked men that then go viral around the world. Technology can expose problematic situations, provide a powerful counterweight to government abuses, and help people organize against them. The weekend before, protesters used social media outreach to organize a march on the White House with little notice, convening thousands of people to walk two miles from a neighborhood park to the heart of executive power. It was an impressive display of digital power and a vivid demonstration of how technology can empower ordinary people.\n\nOn the other hand, my early morning neighborhood encounter underscored that government agents also have their own cameras. They can record protesters and, through facial recognition software, quickly identify participants. Combined with license plate readers, subpoenaed geolocation data, social media monitoring, and drone surveillance, governments have new tools to track protesters and determine who opposes their actions. With some places outlawing protester masks, there is little anonymity in citizen demonstrations anymore, and digital markers can provide an instantaneous means to crack down on ordinary citizens and usher in an authoritarian police state.\n\nAll these tech applications raise the question of how technology will shape citizen protests and law enforcement crackdowns in the future. Right now, there is no obvious winner in the employment of technology. Citizens have great digital tools at their disposal for organizing marches, documenting police actions, and seeking accountability, but law enforcement also has powerful tools—cameras, facial recognition, geolocation, and data mining—to identify protesters and harass opponents.\n\nIt is difficult to know how this tech standoff will unfold. Nearly all technologies are “dual use” tools that can improve people’s lives or serve as instruments of repression. Little in the technology itself dictates constructive or destructive applications; the impact depends on how people choose to use it.\n\nExperiences in other countries that have shifted toward illiberalism or authoritarianism suggest that authorities often prevail in use of technology. In places such as Hungary, Turkey, and Poland, law enforcement agencies have employed digital tools to surveil dissidents and target opponents, and when leaders seek greater control, these technologies can be used to restrict personal rights.\n\nIt is an open question what will happen in the United States as technology becomes more integrated into the broader political climate. Based on citizen videos and firsthand accounts, some voters may become disillusioned with President Trump’s crackdown and conclude that police are abusing their powers and arresting people who have lived peacefully in the country for many years, paid taxes, and been constructive members of their communities. Alternatively, others may feel strongly about crime and the perceived security risks of a porous border, believing that tough methods are required and that the ends justify the means.\n\nWhichever way things go, digital technologies are likely to play a central role in the standoff between citizens and authorities, and in the broader contest between democratic and authoritarian tendencies. The ultimate goals of citizen protest are to influence public opinion, shape election outcomes, and combat disinformation. Whichever side uses technology most effectively could gain a political advantage. The national stakes are high, and digital tools will be a key factor in how Americans interpret and judge the current moment.",
    "authors": [
      "Darrell M. West",
      "Nicol Turner Lee",
      "Rachel M. Perera",
      "Thalia González",
      "Aidan Tomlinson"
    ],
    "images": [
      "https://www.brookings.edu/wp-content/uploads/2025/09/2020-11-20T163213Z_926678623_MT1SIPA0004CSG2M_RTRMADP_3_SIPA-USA-1.jpg?quality=75&w=500",
      "https://www.brookings.edu/wp-content/uploads/2025/04/2022-02-10T150648Z_570633451_RC21HS945RCX_RTRMADP_3_USA-DAILYLIFE-1.jpg?quality=75&w=500",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-international-affairs.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/region/icon-region-europe.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-health-care.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-cities-and-communities.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-education.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/region/icon-region-north-america.svg",
      "https://www.brookings.edu/wp-content/uploads/2024/02/2023-08-11T180044Z_2014379510_MT1USATODAY21185413_RTRMADP_3_DANYA-LAVERACK-LEFT-A-SCHOOL-COUNSELOR-AT-INDIAN-RIVER-1.jpg?quality=75&w=500",
      "https://www.brookings.edu/wp-content/uploads/2016/05/GS_02202024_Darrell-West.jpeg?quality=75&w=198",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-global-economy-and-development.svg",
      "https://www.brookings.edu/wp-content/uploads/2025/09/2025-09-06T000000Z_222766772_MT1NURPHO0003F2PZ7_RTRMADP_3_WASHINGTON-DC-FREE-MARCH-DONALD-TRUMP-1.jpg?quality=75&w=1500",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/region/icon-region-africa.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/region/icon-region-asia.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-society-and-culture.svg",
      "https://www.brookings.edu/wp-content/uploads/2025/09/RoseWillis-KathrynConradARising-Tide-Lifts-All-Bots-2560x1705-1.jpg?quality=75&w=500",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/region/icon-region-middle-east.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-climate-and-energy.svg",
      "https://www.brookings.edu/wp-content/uploads/2023/06/image-work-research.png?quality=75&w=500",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/region/icon-region-latin-america.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-business-and-workforce.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-technology-and-information.svg",
      "https://www.brookings.edu/wp-content/uploads/2016/06/TechTank270Banner.jpg?quality=75&w=270",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-us-economy.svg",
      "https://www.brookings.edu/wp-content/uploads/2025/09/2025-09-06T000000Z_222766772_MT1NURPHO0003F2PZ7_RTRMADP_3_WASHINGTON-DC-FREE-MARCH-DONALD-TRUMP-1.jpg?quality=75",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-defense-and-security.svg",
      "https://www.brookings.edu/wp-content/themes/brookings/assets/svg/icons/topic/icon-topic-us-government-and-politics.svg"
    ],
    "top_image": "https://www.brookings.edu/wp-content/uploads/2025/09/2025-09-06T000000Z_222766772_MT1NURPHO0003F2PZ7_RTRMADP_3_WASHINGTON-DC-FREE-MARCH-DONALD-TRUMP-1.jpg?quality=75",
    "publish_date": null
  },
  {
    "title": "We Finally Have Free Anti-Robocall Tools That Work",
    "description": "We Finally Have Free Anti-Robocall Tools That Work  The New York Times",
    "published date": "Thu, 02 Oct 2025 09:04:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQdldsZEFRQ3c1M1NBaHA5WkdIQ3RfMkFaRkQ5dXprRVg2cGF1bkcyVGFtMG9kVzI3S193WURWSU95MFNza2xUOWM0TF93Wm13WjduMEZlYjhkRHNLeGpUTlpxZU9qVG16SDh2dU16Vm1LUjhNM2RwRGlkM0JERmJYWkx3WTN2V19ZZzJyOV82R0d3RVpiZFI2SUNHaVk0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    },
    "actual_url": "https://www.nytimes.com/2025/10/02/technology/personaltech/iphone-robocalls-screener-android.html",
    "decoded_successfully": true,
    "full_text": "When I received a phone call from an unknown number this week, I didn’t have to pick up the phone to find out it was a robocaller impersonating a utility company with an offer to reduce my bill. A robot spoke on my behalf and told me what the caller had said.\n\nI was testing a call-screening tool for iPhones that is included with Apple’s iOS 26 software system, which arrived last month. Since activating the feature a few weeks ago, I’ve hardly noticed when calls from unfamiliar digits come in. The new tool does its job without ringing my handset.\n\nCall screening should come in handy for lots of smartphone users. Like millions of people across the country, I’ve been bombarded with an uncountable number of spam calls for the last decade. Past tools I’ve tested, such as apps that filtered out calls from numbers identified as scammers, were ineffective.\n\nSome owners of Android phones are in luck, too. Many users of Google’s Pixel phones have had access to a similar call screener for a few years, and this week, Google said it had expanded the tool’s availability to more countries, including Australia, Canada and Ireland. (Unfortunately, most other Android phones still lack this technology.)",
    "authors": [
      "Brian X. Chen"
    ],
    "images": [
      "https://static01.nyt.com/images/2025/09/30/business/00techfix-spam/00techfix-spam-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
      "https://static01.nyt.com/images/2018/02/16/multimedia/author-brian-x-chen/author-brian-x-chen-thumbLarge-v2.png",
      "https://static01.nyt.com/images/2025/09/30/business/00techfix-spam/00techfix-spam-facebookJumbo.jpg"
    ],
    "top_image": "https://static01.nyt.com/images/2025/09/30/business/00techfix-spam/00techfix-spam-facebookJumbo.jpg",
    "publish_date": "2025-10-02 00:00:00"
  },
  {
    "title": "Building Edge AI Processors With DigAn Technology",
    "description": "Building Edge AI Processors With DigAn Technology  EE Times",
    "published date": "Thu, 02 Oct 2025 08:26:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1MN2hUSEdEZER2cmwzQTlJLWo4QkJpMmxncWg2NXV3aFY5N2tEWUxuWmlhMUN2SXNydXRkN0NTV055U25pbGFVSVk1QTlSMjh4MEJWTld2X00zUEhZamFBYXdJTm05dG9OcGdTOEV3VGt6ZS1wS19PTE5teWVzRnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eetimes.com",
      "title": "EE Times"
    },
    "actual_url": "https://www.eetimes.com/building-edge-ai-processors-with-digan-technology/",
    "decoded_successfully": true,
    "full_text": "//php echo do_shortcode('[responsivevoice_button voice=\"US English Male\" buttontext=\"Listen to Post\"]') ?>\n\nIn a hall buzzing with talk of megafabs and AI supercomputers, one startup is quietly asking a different question: how smart can a device be on a coin-cell battery?\n\nAt Electronica India 2025, Ambient Scientific unveiled its edge-AI chips. The startup claims to reshape how we think about intelligence at the edge by blending digital logic with analog shortcuts to run voice, vision, and sensor AI for months without recharging.\n\nGajendra P. Singh\n\nFounded by Gajendra P. Singh, Ambient Scientific’s secret recipe lies in its proprietary DigAn silicon architecture, a hybrid of digital and analog computing that allows AI to run at high speed while consuming very little power. “The aim is simple—to make processors that are natively built for AI rather than repurposed from general-purpose computing,” Singh said in an exclusive interview with EE Times.\n\nThe company’s most recent product, the GPX10 Pro, is available for sampling, with volume production slated for Q1 2026. The GPX10 Pro is designed for battery-operated devices and supports common AI workloads, including voice recognition, keyword spotting, lightweight vision, and sensor-based intelligence at very low power levels. Singh said general-purpose architectures constrain conventional MCUs and NPUs: “It’s like hitting a baseball with a tennis racket, the wrong tool for the job. The GPX10 Pro shows what’s possible with silicon built natively for AI.”\n\nPartner Content View All\n\nBy Pu Zhang, Senior Principal Engineer, High Performance Computing, Renesas 10.02.2025 By Invest in Pomerania 10.01.2025 By MRPeasy 10.01.2025\n\nFrom personal tragedy to technology vision\n\nThe story of Ambient Scientific started with a personal turning point. While Singh was working in the United States, his father suffered a sudden medical emergency and could not survive. “For me, that was an extreme personal shock,” Singh recalls. “I realized that technology can solve many such problems. My goal was to create a device that could help in such situations so that lives can be saved.”\n\nAs he explored existing solutions, Singh noticed a gap. In the U.S. and Europe, devices such as pendants with a push button were available to call for help in emergencies. But, as he pointed out, “My own mother, for example, would never wear something bulky like that.” His idea was to design a tiny, intelligent device that operates automatically. That was the moment Singh decided to leave his job and begin developing what would become Ambient Scientific. “Over time, our vision as a company has grown. Now, we aim to become a large technology company,” he said.\n\nDesigning DigAn from scratch\n\nTo create a device small enough to carry out such tasks, Singh realized he would have to design a chip from scratch. Chip design is an expensive and complex undertaking, but it also has broad potential for investors. Ambient Scientific bet that processors designed natively for AI would open new possibilities.\n\nDuring their research, Singh and his team examined analog AI approaches but found them inconsistent. Their solution was a hybrid design — digital-analog, or DigAn. “Analog circuitry is good for matrix multiplication, but it can be inconsistent and unreliable. In mathematics, reliability and consistency are very important,” Singh explains. By adding digital control in key places, Ambient was able to use analog for the bulk of the workload while improving stability.\n\nAmbient Scientific also developed its own instruction set for AI functions and built a new architecture called the MXX core, which comes in versions such as MX-8, MX-16, and MX-32. Each MXX core functions as an independent AI computer, and combining them allows the company to create systems-on-chip (SoCs) tailored to different needs. The company’s first SoC, the GPX-10, is targeted for small devices.\n\nAmbient Scientific GPX10 Pro\n\nThe GPX10 Pro is built around ten MX8 AI cores, organized in two sets of five across separate power domains. This setup enables the processor to perform up to 2,560 multiply-accumulate operations per cycle, resulting in a peak throughput of 512 GOPs. To support larger and more complex models, the chip includes 2MB of on-chip SRAM, which is ten times more than the earlier GPX10.\n\nAmbient claims that the processor can perform always-on keyword detection while consuming less than 100 microwatts, enabling it to operate on a small coin-cell battery. An integrated Arm Cortex-M4F CPU core handles control functions, while analog features include a low-power ADC, enhanced I2S logic, and interfaces for up to 28 sensors, comprising eight analog and 20 digital sensors.\n\nTo make sensor data useful in real-time, the GPX10 Pro incorporates SenseMesh, a tightly coupled sensor fusion layer that reduces latency by directly connecting multiple sensors to the core.\n\nThe chip is fully supported by Ambient Scientific’s Nebula toolchain, which allows developers to deploy models trained using TensorFlow, Keras, or ONNX.\n\nTarget markets and applications\n\nThe immediate applications Singh sees for Ambient’s processors are in personal safety and healthcare. One example is a pendant that can detect if a person falls and automatically send an SOS alert without requiring them to press a button. Healthcare and fitness wearables are another area where Singh believes Ambient’s chips can make step counting more precise. “Current watches can give misleading results, such as counting steps even when you are sitting in a car. Our processors can make this more accurate,” he says.\n\nBeyond wearables, the processors can also be used for animal health monitoring, particularly valuable to farmers, and in predictive maintenance for motors, including those in cars and household appliances. Looking further ahead, Singh said the company’s second chip will focus on high-density vision applications.\n\nGrowth strategy and expansion plans\n\nAmbient Scientific headquarters are in Santa Clara, with a sizable design team in India. Singh said that these are embedded AI devices, which means the team works on both hardware and embedded programming. Engineers train in the U.S. and Singapore before collaborating with the Indian team.\n\nIndia’s semiconductor ecosystem has improved over the past two decades, Singh said, though challenges remain. “Since 2000, the ecosystem in India has improved dramatically, especially in the past decade. However, designing chips involves different steps, and the infrastructure still needs to grow further. That said, we are seeing progress,” he elaborated.\n\nThe company has relied on small entities and individual investors. “Deep technology requires patient capital, and this is extremely deep technology,” Singh said. “Most investors expect returns within a short timeframe, which is not realistic here. We are fortunate to have patient investors supporting us.”\n\nTo reach customers, Ambient Scientific works through distributors and ecosystem partners rather than direct sales. Distributors are already in place in Asia and Europe, and deals are coming in the U.S. and Japan. Partners trained in Ambient’s technology support customers in building applications, which Singh believes creates a domino effect as more partners come on board.\n\nAlthough personal experiences sparked Singh’s ideas, he stressed that the company’s vision is global. “Many of our problem statements are rooted in Indian realities, but they are also global problems. Our solutions are meant for the global market, even though they started from personal experiences,” he concluded.",
    "authors": [
      "Yashasvini Razdan",
      "Nitin Dahad",
      "Sally Ward-Foxton",
      "Maurizio Di Paolo Emilio",
      ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow",
      "Class",
      "Wp-Block-Co-Authors-Plus",
      "Display Inline",
      ".Wp-Block-Co-Authors-Plus-Avatar",
      "Where Img"
    ],
    "images": [
      "https://www.eetimes.com/wp-content/uploads/f25799df63a72b343037e4f25ce637d0.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/7051344d9678dce3ecc66c8848bd6507.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/db2daee014c5f4869f8de0896d3a2b8c.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/5c91e78680a078a1144a99db55192708.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/45f0bcb292b6ff5a2e02ee8345a74c54.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/37206425924024db91e4b8f49e2b1f2e.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/themes/ee-times-child/assets/theitservicessite_top_msg_arrow.gif",
      "https://www.eetimes.com/wp-content/uploads/1cd0679ae3cf2a7088eb15c9e48e9580.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/4a269c14f80de3a3a032f7b21ed8bbe4.png?fit=276%2C80",
      "https://ad.doubleclick.net/ddm/activity/src=9330592;type=invmedia;cat=eetim000;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;npa=;ord=1;num=1",
      "https://www.eetimes.com/wp-content/uploads/6d487d81fce44c9c2381c37971b31efc.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/AI-Maths.jpg?w=300",
      "https://www.eetimes.com/wp-content/uploads/aeccbcd495a9bb3498eaa758a1b25cbe.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/Ambient-Scientic-GPX10-Pro_Final.jpg?w=300",
      "https://www.eetimes.com/wp-content/uploads/Meta-sq.jpg?w=300",
      "https://www.eetimes.com/wp-content/uploads/2dc8297ba0272c355dbf9ba7676d5d24.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/image_f95e1a-e1759392751223.png?resize=640%2C640",
      "https://www.eetimes.com/wp-content/uploads/iMOTION-600x340-1.jpg?w=62",
      "https://www.eetimes.com/wp-content/uploads/cba54a429b63cd68bea2b7431c99e052.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/themes/ee-times-child/assets/images/loading.gif",
      "https://www.eetimes.com/wp-content/uploads/Optimec-600x340-1.jpg?w=62",
      "https://www.eetimes.com/wp-content/uploads/eetimes-eu-logo.jpg?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/16f9b66796092b3dd986ffdef8510b1d.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/TI-IMAGE.png?resize=298,185",
      "https://www.eetimes.com/wp-content/uploads/AdobeStock_1058102650_Editorial_Use_Only.jpeg?w=300",
      "https://www.eetimes.com/wp-content/uploads/image_d0930a.png?resize=640%2C457",
      "https://www.eetimes.com/wp-content/uploads/epsnews-logo.jpg?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/3dba11e10d7fa0b6e6c966d24e7ff3ba.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/4f4544be6ae0d4a6ecb3763ffcace961.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/Yashasvini-Razdan-sq-headshot.jpg?fit=173%2C173",
      "https://www.eetimes.com/wp-content/uploads//wp-content/uploads/2019/12/datasheets.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/927f69e30c7005c79ee64f1bea5b0126.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/dcfaec25b9c732cfffb004e8d6352938.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/Ambient-Scientic-GPX10-Pro_Final.jpg",
      "https://www.eetimes.com/wp-content/uploads/e3d05c371af1c56f20577da4d10c10f6.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/706a36065aa35bee453549807d246889.png?fit=276%2C80",
      "https://www.eetimes.com/wp-content/uploads/invest_pomerania_Thumbnail-600x340-1.png?w=62",
      "https://www.eetimes.com/wp-content/uploads/0882892d9552d95916d70ef88fc8deca.png?fit=276%2C80"
    ],
    "top_image": "https://www.eetimes.com/wp-content/uploads/Ambient-Scientic-GPX10-Pro_Final.jpg",
    "publish_date": "2025-10-02 07:05:52+00:00"
  },
  {
    "title": "How Shifts In Technology Will Create Unexpected Uses Of AI",
    "description": "How Shifts In Technology Will Create Unexpected Uses Of AI  Forbes",
    "published date": "Thu, 02 Oct 2025 12:22:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOYi1CTzVhU2R5XzFmbkJCQzJvMlk1OWtOWVdSbDZ4ek9MMEpnbm9HZjZ4ZG5JWlVmVkk0cU5jUld0MjVjdzNneV9PalJmSWNael9Ld0Q2a2pxTG1sVVh4YUJxOHMzTGRER25jbGhvdW9ZZHpFVUthUGVTNGxyczQ0c2xvTXdlWkF6RGs5ZWtseTdmTUc5WUp4N3FGU1Fyc0FZRkhMdThBZk5ySTM4SHliNXdDVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    },
    "actual_url": "https://www.forbes.com/sites/dianehamilton/2025/10/02/how-shifts-in-technology-will-create-unexpected-uses-of-ai/",
    "decoded_successfully": true,
    "full_text": null,
    "error": "Article `download()` failed with 403 Client Error: Max restarts limit reached for url: https://www.forbes.com/sites/dianehamilton/2025/10/02/how-shifts-in-technology-will-create-unexpected-uses-of-ai/ on URL https://www.forbes.com/sites/dianehamilton/2025/10/02/how-shifts-in-technology-will-create-unexpected-uses-of-ai/",
    "authors": [],
    "images": [],
    "top_image": null,
    "publish_date": null
  }
]